exkurs-05-WS-Grundlagen/wsdl/ws-addressing/PingWS.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.5-hudson-$BUILD_NUMBER-. -->
<definitions targetNamespace="http://wsaddr.traudel.de/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://wsaddr.traudel.de/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://wsaddr.traudel.de/" schemaLocation="PingWS_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="ping">
    <part name="parameters" element="tns:ping"/>
  </message>
  <message name="pingResponse">
    <part name="parameters" element="tns:pingResponse"/>
  </message>
  <portType name="PingWS">
    <operation name="ping">
      <input ns1:Action="http://wsaddr.traudel.de/PingWS/pingRequest" message="tns:ping" xmlns:ns1="http://www.w3.org/2006/05/addressing/wsdl"/>
      <output message="tns:pingResponse"/>
    </operation>
  </portType>
</definitions>

